-- --------------------------------------------------------
-- 主机:                           127.0.0.1
-- 服务器版本:                        8.0.16 - MySQL Community Server - GPL
-- 服务器OS:                        Win64
-- HeidiSQL 版本:                  10.2.0.5599
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;


-- Dumping database structure for soilmoisture
DROP DATABASE IF EXISTS `soilmoisture`;
CREATE DATABASE IF NOT EXISTS `soilmoisture` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `soilmoisture`;

-- Dumping structure for table soilmoisture.battery
DROP TABLE IF EXISTS `battery`;
CREATE TABLE IF NOT EXISTS `battery` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键ID',
  `battery_currentValue` varchar(10) NOT NULL DEFAULT '0' COMMENT '电池电流值',
  `battery_voltageValue` varchar(10) NOT NULL DEFAULT '0' COMMENT '电池电压值',
  `illumination_value` varchar(10) NOT NULL DEFAULT '0' COMMENT '光照值',
  `creat_time` datetime NOT NULL COMMENT '存储数据时间',
  `battery_code` varchar(10) NOT NULL COMMENT '传感器编码',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- Dumping data for table soilmoisture.battery: ~2 rows (大约)
/*!40000 ALTER TABLE `battery` DISABLE KEYS */;
REPLACE INTO `battery` (`id`, `battery_currentValue`, `battery_voltageValue`, `illumination_value`, `creat_time`, `battery_code`) VALUES
	(1, '12239236', '0', '0', '2019-09-11 03:18:26', '电池'),
	(2, '12239236', '0', '0', '2019-09-11 03:53:19', '电池');
/*!40000 ALTER TABLE `battery` ENABLE KEYS */;

-- Dumping structure for table soilmoisture.sensor
DROP TABLE IF EXISTS `sensor`;
CREATE TABLE IF NOT EXISTS `sensor` (
  `id` int(4) NOT NULL AUTO_INCREMENT COMMENT 'ID',
  `sensor_code` varchar(10) NOT NULL COMMENT '传感器编码',
  `sensor_currentValue` varchar(10) NOT NULL COMMENT '传感器电流值',
  `sensor_voltageValue` varchar(10) NOT NULL COMMENT '传感器电压值',
  `creat_time` datetime NOT NULL COMMENT '数据存储时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- Dumping data for table soilmoisture.sensor: ~15 rows (大约)
/*!40000 ALTER TABLE `sensor` DISABLE KEYS */;
REPLACE INTO `sensor` (`id`, `sensor_code`, `sensor_currentValue`, `sensor_voltageValue`, `creat_time`) VALUES
	(1, '1', '1', '1', '2019-09-09 09:02:46'),
	(2, '气压', '11999714', '272314', '2019-09-10 03:27:31'),
	(3, '气压', '11999714', '272314', '2019-09-10 03:28:38'),
	(4, '气压', '11999714', '272314', '2019-09-10 03:29:19'),
	(5, '气压', '11999714', '272314', '2019-09-10 03:35:57'),
	(6, '气压', '11999714', '272314', '2019-09-10 03:36:38'),
	(7, '风速', '12160847', '1737817', '2019-09-10 09:31:28'),
	(8, '风向', '12160847', '1737817', '2019-09-10 09:36:53'),
	(9, '雨量', '12160847', '1737817', '2019-09-10 15:58:12'),
	(10, '风速', '12160847', '1737817', '2019-09-11 05:23:16'),
	(11, '风速', '12160847', '1737817', '2019-09-11 07:22:02'),
	(12, '风速', '12160847', '1737817', '2019-09-11 07:23:16'),
	(13, '风速', '12160847', '1737817', '2019-09-11 07:26:26'),
	(14, '太阳能控制器', '12160847', '1737817', '2019-09-11 07:57:43'),
	(15, '温湿度', '11999714', '272314', '2019-09-11 11:58:31'),
	(16, '太阳能控制器', '12160847', '1737817', '2019-09-11 11:59:31');
/*!40000 ALTER TABLE `sensor` ENABLE KEYS */;

-- Dumping structure for table soilmoisture.sensor_type
DROP TABLE IF EXISTS `sensor_type`;
CREATE TABLE IF NOT EXISTS `sensor_type` (
  `id` int(4) NOT NULL AUTO_INCREMENT COMMENT '主键ID',
  `sensor_name` varchar(10) NOT NULL COMMENT '传感器名称',
  `sensor_code` varchar(10) NOT NULL COMMENT '传感器编码',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=12 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='传感器类型表';

-- Dumping data for table soilmoisture.sensor_type: ~11 rows (大约)
/*!40000 ALTER TABLE `sensor_type` DISABLE KEYS */;
REPLACE INTO `sensor_type` (`id`, `sensor_name`, `sensor_code`) VALUES
	(1, '风速', '01'),
	(2, '风向', '02'),
	(3, '光照', '03'),
	(4, '雨量', '04'),
	(5, 'PM2.5', '05'),
	(6, 'GPRS', '06'),
	(7, '太阳能控制器', '0a'),
	(8, '温湿度', '07'),
	(9, '气压', '08'),
	(10, '土温', '09'),
	(11, '电池', '10');
/*!40000 ALTER TABLE `sensor_type` ENABLE KEYS */;

-- Dumping structure for table soilmoisture.weather
DROP TABLE IF EXISTS `weather`;
CREATE TABLE IF NOT EXISTS `weather` (
  `id` int(4) NOT NULL AUTO_INCREMENT COMMENT '主键ID',
  `city` varchar(10) NOT NULL COMMENT '城市',
  `cond_txt` varchar(10) NOT NULL COMMENT '天气实况',
  `tmp_max` varchar(10) NOT NULL COMMENT '最高温度',
  `tmp_min` varchar(10) NOT NULL COMMENT '最低温度',
  `wind_dir` varchar(10) NOT NULL COMMENT '风向',
  `wind_sc` varchar(10) NOT NULL COMMENT '风力',
  `hum` varchar(10) NOT NULL COMMENT '相对湿度',
  `pres` varchar(10) NOT NULL COMMENT '大气压强',
  `sunStartTime` varchar(50) NOT NULL COMMENT '日出时间',
  `sunEndTime` varchar(50) NOT NULL COMMENT '日落时间',
  `dateTime` varchar(50) NOT NULL COMMENT '日期',
  `creat_time` datetime NOT NULL COMMENT '查询时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=64 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- Dumping data for table soilmoisture.weather: ~56 rows (大约)
/*!40000 ALTER TABLE `weather` DISABLE KEYS */;
REPLACE INTO `weather` (`id`, `city`, `cond_txt`, `tmp_max`, `tmp_min`, `wind_dir`, `wind_sc`, `hum`, `pres`, `sunStartTime`, `sunEndTime`, `dateTime`, `creat_time`) VALUES
	(6, '北京', '多云', '29', '18', '西南风', '4', '48', '1003', '05:56', '18:21', '2019-09-15', '2019-09-10 10:07:07'),
	(7, '北京', '多云', '27', '18', '东北风', '1', '37', '1013', '05:56', '18:20', '2019-09-16', '2019-09-10 10:07:07'),
	(8, '武汉', '多云', '35', '25', '东北风', '18', '63', '1009', '06:04', '18:33', '2019-09-10', '2019-09-10 15:03:42'),
	(9, '武汉', '晴', '36', '25', '东风', '17', '69', '1009', '06:05', '18:32', '2019-09-11', '2019-09-10 15:03:42'),
	(10, '武汉', '晴', '36', '26', '东南风', '13', '69', '1006', '06:05', '18:31', '2019-09-12', '2019-09-10 15:03:42'),
	(11, '武汉', '晴', '37', '26', '北风', '14', '50', '1008', '06:06', '18:29', '2019-09-13', '2019-09-10 15:03:42'),
	(12, '武汉', '晴', '35', '26', '北风', '18', '79', '1007', '06:07', '18:28', '2019-09-14', '2019-09-10 15:03:42'),
	(13, '武汉', '多云', '34', '26', '东北风', '11', '74', '1005', '06:07', '18:27', '2019-09-15', '2019-09-10 15:03:42'),
	(14, '武汉', '晴', '36', '25', '东北风', '23', '70', '1006', '06:08', '18:26', '2019-09-16', '2019-09-10 15:03:43'),
	(15, '武汉', '多云', '35', '25', '东北风', '18', '63', '1009', '06:04', '18:33', '2019-09-10', '2019-09-10 15:04:15'),
	(16, '武汉', '晴', '36', '25', '东风', '17', '69', '1009', '06:05', '18:32', '2019-09-11', '2019-09-10 15:04:15'),
	(17, '武汉', '晴', '36', '26', '东南风', '13', '69', '1006', '06:05', '18:31', '2019-09-12', '2019-09-10 15:04:15'),
	(18, '武汉', '晴', '37', '26', '北风', '14', '50', '1008', '06:06', '18:29', '2019-09-13', '2019-09-10 15:04:15'),
	(19, '武汉', '晴', '35', '26', '北风', '18', '79', '1007', '06:07', '18:28', '2019-09-14', '2019-09-10 15:04:15'),
	(20, '武汉', '多云', '34', '26', '东北风', '11', '74', '1005', '06:07', '18:27', '2019-09-15', '2019-09-10 15:04:15'),
	(21, '武汉', '晴', '36', '25', '东北风', '23', '70', '1006', '06:08', '18:26', '2019-09-16', '2019-09-10 15:04:15'),
	(22, '武汉', '多云', '35', '25', '东北风', '18', '63', '1009', '06:04', '18:33', '2019-09-10', '2019-09-10 15:12:51'),
	(23, '武汉', '晴', '36', '25', '东风', '17', '69', '1009', '06:05', '18:32', '2019-09-11', '2019-09-10 15:12:52'),
	(24, '武汉', '晴', '36', '26', '东南风', '13', '69', '1006', '06:05', '18:31', '2019-09-12', '2019-09-10 15:12:52'),
	(25, '武汉', '晴', '37', '26', '北风', '14', '50', '1008', '06:06', '18:29', '2019-09-13', '2019-09-10 15:12:52'),
	(26, '武汉', '晴', '35', '26', '北风', '18', '79', '1007', '06:07', '18:28', '2019-09-14', '2019-09-10 15:12:52'),
	(27, '武汉', '多云', '34', '26', '东北风', '11', '74', '1005', '06:07', '18:27', '2019-09-15', '2019-09-10 15:12:52'),
	(28, '武汉', '晴', '36', '25', '东北风', '23', '70', '1006', '06:08', '18:26', '2019-09-16', '2019-09-10 15:12:52'),
	(29, '成都', '阴', '25', '21', '无持续风向', '8', '84', '950', '06:45', '19:14', '2019-09-10', '2019-09-10 15:34:11'),
	(30, '成都', '阵雨', '27', '22', '无持续风向', '1', '94', '949', '06:46', '19:13', '2019-09-11', '2019-09-10 15:34:11'),
	(31, '成都', '阵雨', '27', '21', '无持续风向', '10', '83', '950', '06:46', '19:12', '2019-09-12', '2019-09-10 15:34:11'),
	(32, '成都', '大雨', '24', '18', '无持续风向', '8', '86', '954', '06:47', '19:10', '2019-09-13', '2019-09-10 15:34:12'),
	(33, '成都', '小雨', '22', '18', '无持续风向', '1', '86', '953', '06:47', '19:09', '2019-09-14', '2019-09-10 15:34:12'),
	(34, '成都', '多云', '24', '19', '无持续风向', '11', '79', '951', '06:48', '19:08', '2019-09-15', '2019-09-10 15:34:12'),
	(35, '成都', '小雨', '25', '20', '无持续风向', '6', '85', '950', '06:49', '19:06', '2019-09-16', '2019-09-10 15:34:12'),
	(36, '青岛', '多云', '30', '22', '北风', '15', '68', '1014', '05:37', '18:12', '2019-09-10', '2019-09-10 15:34:35'),
	(37, '青岛', '多云', '29', '22', '南风', '14', '62', '1013', '05:38', '18:10', '2019-09-11', '2019-09-10 15:34:35'),
	(38, '青岛', '多云', '28', '23', '东南风', '16', '68', '1009', '05:39', '18:09', '2019-09-12', '2019-09-10 15:34:35'),
	(39, '青岛', '阴', '28', '23', '东南风', '21', '88', '1009', '05:40', '18:07', '2019-09-13', '2019-09-10 15:34:35'),
	(40, '青岛', '阴', '29', '21', '东北风', '23', '61', '1011', '05:40', '18:06', '2019-09-14', '2019-09-10 15:34:35'),
	(41, '青岛', '多云', '28', '21', '东南风', '21', '52', '1009', '05:41', '18:04', '2019-09-15', '2019-09-10 15:34:36'),
	(42, '青岛', '多云', '27', '22', '南风', '17', '67', '1010', '05:42', '18:03', '2019-09-16', '2019-09-10 15:34:36'),
	(43, '天津', '阴', '25', '21', '东北风', '2', '49', '1020', '05:48', '18:26', '2019-09-10', '2019-09-10 15:36:10'),
	(44, '天津', '多云', '26', '20', '北风', '3', '51', '1018', '05:49', '18:24', '2019-09-11', '2019-09-10 15:36:11'),
	(45, '天津', '阴', '27', '19', '西南风', '4', '90', '1009', '05:50', '18:23', '2019-09-12', '2019-09-10 15:36:11'),
	(46, '天津', '小雨', '26', '18', '北风', '11', '79', '1015', '05:51', '18:21', '2019-09-13', '2019-09-10 15:36:11'),
	(47, '天津', '晴', '28', '18', '南风', '8', '53', '1014', '05:52', '18:20', '2019-09-14', '2019-09-10 15:36:11'),
	(48, '天津', '晴', '28', '19', '西南风', '10', '55', '1011', '05:53', '18:18', '2019-09-15', '2019-09-10 15:36:11'),
	(49, '天津', '阴', '29', '17', '北风', '2', '75', '1013', '05:54', '18:16', '2019-09-16', '2019-09-10 15:36:11'),
	(50, '南京', '阴', '32', '24', '东北风', '10', '91', '1012', '05:46', '18:16', '2019-09-10', '2019-09-10 15:38:29'),
	(51, '南京', '多云', '32', '24', '东北风', '8', '91', '1012', '05:46', '18:15', '2019-09-11', '2019-09-10 15:38:29'),
	(52, '南京', '多云', '32', '24', '东风', '11', '88', '1008', '05:47', '18:13', '2019-09-12', '2019-09-10 15:38:29'),
	(53, '南京', '多云', '32', '22', '东风', '10', '87', '1008', '05:48', '18:12', '2019-09-13', '2019-09-10 15:38:29'),
	(54, '南京', '小雨', '29', '22', '东北风', '9', '90', '1009', '05:48', '18:11', '2019-09-14', '2019-09-10 15:38:29'),
	(55, '南京', '晴', '29', '23', '东北风', '5', '70', '1008', '05:49', '18:09', '2019-09-15', '2019-09-10 15:38:29'),
	(56, '南京', '多云', '29', '21', '东北风', '10', '81', '1009', '05:49', '18:08', '2019-09-16', '2019-09-10 15:38:29'),
	(57, '上海', '阴', '32', '25', '东北风', '12', '75', '1013', '05:36', '18:04', '2019-09-11', '2019-09-11 03:28:56'),
	(58, '上海', '阴', '31', '24', '东风', '20', '79', '1010', '05:36', '18:02', '2019-09-12', '2019-09-11 03:28:57'),
	(59, '上海', '多云', '31', '24', '东南风', '21', '77', '1010', '05:37', '18:01', '2019-09-13', '2019-09-11 03:28:57'),
	(60, '上海', '多云', '30', '24', '东北风', '24', '71', '1010', '05:38', '18:00', '2019-09-14', '2019-09-11 03:28:57'),
	(61, '上海', '多云', '30', '25', '东北风', '17', '79', '1009', '05:38', '17:58', '2019-09-15', '2019-09-11 03:28:57'),
	(62, '上海', '多云', '30', '25', '东北风', '12', '63', '1011', '05:39', '17:57', '2019-09-16', '2019-09-11 03:28:57'),
	(63, '上海', '多云', '29', '25', '东北风', '18', '75', '1013', '05:39', '17:56', '2019-09-17', '2019-09-11 03:28:57');
/*!40000 ALTER TABLE `weather` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
